ch570512/Qlockwork/src/main.cpp
// Page settings
void handleButtonSettings()
{
#ifdef DEBUG
    Serial.println(F("Settings pressed"));
#endif
    String message = "<!doctype html>"
                     "<html>"
                     "<head>"
                     "<title>" +
                     String(WEBSITE_TITLE) + " " TXT_SETTINGS "</title>"
                                             "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">"
                                             "<meta charset=\"UTF-8\">"
                                             "<link rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css\">"
                                             "<style>"
                                             "body{background-color:#FFFFFF;text-align:center;color:#333333;font-family:Sans-serif;font-size:16px;}"
                                             "input[type=submit]{background-color:#1FA3EC;text-align:center;color:#FFFFFF;width:200px;padding:12px;border:5px solid #FFFFFF;font-size:20px;border-radius:10px;}"
                                             "table{border-collapse:collapse;margin:0px auto;} td{padding:12px;border-bottom:1px solid #ddd;} tr:first-child{border-top:1px solid #ddd;} td:first-child{text-align:right;} td:last-child{text-align:left;}"
                                             "select{font-size:16px;}"
                                             "button{background-color:#1FA3EC;text-align:center;color:#FFFFFF;width:200px;padding:10px;border:5px solid #FFFFFF;font-size:24px;border-radius:10px;}"
                                             "</style>"
                                             "</head>"
                                             "<body>"
                                             "<h1>" +
                     String(WEBSITE_TITLE) + " " TXT_SETTINGS "</h1>"
                                             "<form action=\"/commitSettings\">"
                                             "<table>";
    // ------------------------------------------------------------------------
#ifdef BUZZER
    message += "<tr><td>" TXT_ALARM
               " 1</td><td>"
               "<input type=\"radio\" name=\"a1\" value=\"1\"";
    if (settings.mySettings.alarm1)
        message += " checked";
    message += "> " TXT_ON
               "<input type=\"radio\" name=\"a1\" value=\"0\"";
    if (!settings.mySettings.alarm1)
        message += " checked";
    message += "> " TXT_OFF "&nbsp;&nbsp;&nbsp;"
               "<input type=\"time\" name=\"a1t\" value=\"";
    if (getHour(settings.mySettings.alarm1Time) < 10)
        message += "0";
    message += String(getHour(settings.mySettings.alarm1Time)) + ":";
    if (getMinute(settings.mySettings.alarm1Time) < 10)
        message += "0";
    message += String(getMinute(settings.mySettings.alarm1Time)) + "\">"
                                                                   " h<br><br>"
                                                                   "<input type=\"checkbox\" name=\"a1w2\" value=\"4\"";
    if (bitRead(settings.mySettings.alarm1Weekdays, 2))
        message += " checked";
    message += "> Mo. "
               "<input type=\"checkbox\" name=\"a1w3\" value=\"8\"";
    if (bitRead(settings.mySettings.alarm1Weekdays, 3))
        message += " checked";
    message += "> Tu. "
               "<input type=\"checkbox\" name=\"a1w4\" value=\"16\"";
    if (bitRead(settings.mySettings.alarm1Weekdays, 4))
        message += " checked";
    message += "> We. "
               "<input type=\"checkbox\" name=\"a1w5\" value=\"32\"";
    if (bitRead(settings.mySettings.alarm1Weekdays, 5))
        message += " checked";
    message += "> Th. "
               "<input type=\"checkbox\" name=\"a1w6\" value=\"64\"";
    if (bitRead(settings.mySettings.alarm1Weekdays, 6))
        message += " checked";
    message += "> Fr. "
               "<input type=\"checkbox\" name=\"a1w7\" value=\"128\"";
    if (bitRead(settings.mySettings.alarm1Weekdays, 7))
        message += " checked";
    message += "> Sa. "
               "<input type=\"checkbox\" name=\"a1w1\" value=\"2\"";
    if (bitRead(settings.mySettings.alarm1Weekdays, 1))
        message += " checked";
    message += "> Su. "
               "</td></tr>";
    // ------------------------------------------------------------------------
    message += "<tr><td>" TXT_ALARM
               " 2</td><td>"
               "<input type=\"radio\" name=\"a2\" value=\"1\"";
    if (settings.mySettings.alarm2)
        message += " checked";
    message += "> " TXT_ON
               "<input type=\"radio\" name=\"a2\" value=\"0\"";
    if (!settings.mySettings.alarm2)
        message += " checked";
    message += "> " TXT_OFF "&nbsp;&nbsp;&nbsp;"
               "<input type=\"time\" name=\"a2t\" value=\"";
    if (getHour(settings.mySettings.alarm2Time) < 10)
        message += "0";
    message += String(getHour(settings.mySettings.alarm2Time)) + ":";
    if (getMinute(settings.mySettings.alarm2Time) < 10)
        message += "0";
    message += String(getMinute(settings.mySettings.alarm2Time)) + "\">"
                                                                   " h<br><br>"
                                                                   "<input type=\"checkbox\" name=\"a2w2\" value=\"4\"";
    if (bitRead(settings.mySettings.alarm2Weekdays, 2))
        message += " checked";
    message += "> Mo. "
               "<input type=\"checkbox\" name=\"a2w3\" value=\"8\"";
    if (bitRead(settings.mySettings.alarm2Weekdays, 3))
        message += " checked";
    message += "> Tu. "
               "<input type=\"checkbox\" name=\"a2w4\" value=\"16\"";
    if (bitRead(settings.mySettings.alarm2Weekdays, 4))
        message += " checked";
    message += "> We. "
               "<input type=\"checkbox\" name=\"a2w5\" value=\"32\"";
    if (bitRead(settings.mySettings.alarm2Weekdays, 5))
        message += " checked";
    message += "> Th. "
               "<input type=\"checkbox\" name=\"a2w6\" value=\"64\"";
    if (bitRead(settings.mySettings.alarm2Weekdays, 6))
        message += " checked";
    message += "> Fr. "
               "<input type=\"checkbox\" name=\"a2w7\" value=\"128\"";
    if (bitRead(settings.mySettings.alarm2Weekdays, 7))
        message += " checked";
    message += "> Sa. "
               "<input type=\"checkbox\" name=\"a2w1\" value=\"2\"";
    if (bitRead(settings.mySettings.alarm2Weekdays, 1))
        message += " checked";
    message += "> Su. "
               "</td></tr>";
    // ------------------------------------------------------------------------
    message += "<tr><td>" TXT_TIMER
               "</td><td>"
               "<select name=\"ti\">";
    for (int i = 0; i <= 10; i++)
    {
        message += "<option value=\"" + String(i) + "\">";
        if (i < 10)
            message += "0";
        message += String(i) + "</option>";
    }
    message += "<option value=\"15\">15</option>"
               "<option value=\"20\">20</option>"
               "<option value=\"25\">25</option>"
               "<option value=\"30\">30</option>"
               "<option value=\"45\">45</option>"
               "<option value=\"60\">60</option>"
               "</select> " TXT_MINUTES
               "</td></tr>";
    // ------------------------------------------------------------------------
    message += "<tr><td>" TXT_HOURBEEP
               "</td><td>"
               "<input type=\"radio\" name=\"hb\" value=\"1\"";
    if (settings.mySettings.hourBeep)
        message += " checked";
    message += "> " TXT_ON
               "<input type=\"radio\" name=\"hb\" value=\"0\"";
    if (!settings.mySettings.hourBeep)
        message += " checked";
    message += "> " TXT_OFF
               "</td></tr>";
#endif
    // ------------------------------------------------------------------------
#ifdef SENSOR_DHT22
    message += "<tr><td>"
               "Show temperature"
               "</td><td>"
               "<input type=\"radio\" name=\"mc\" value=\"1\"";
    if (settings.mySettings.modeChange)
        message += " checked";
    message += "> " TXT_ON
               "<input type=\"radio\" name=\"mc\" value=\"0\"";
    if (!settings.mySettings.modeChange)
        message += " checked";
    message += "> " TXT_OFF
               "</td></tr>";
#endif
    // ------------------------------------------------------------------------
#ifdef LDR
    message += "<tr><td>"
               "ABC"
               "</td><td>"
               "<input type=\"radio\" name=\"ab\" value=\"1\"";
    if (settings.mySettings.useAbc)
        message += " checked";
    message += "> " TXT_ON
               "<input type=\"radio\" name=\"ab\" value=\"0\"";
    if (!settings.mySettings.useAbc)
        message += " checked";
    message += "> " TXT_OFF
               "</td></tr>";
#endif
    // ------------------------------------------------------------------------
    message += "<tr><td>"
               "Brightness"
               "</td><td>"
               "<select name=\"br\">";
    for (int i = 10; i <= 100; i += 10)
    {
        message += "<option value=\"" + String(i) + "\"";
        if (i == settings.mySettings.brightness)
            message += " selected";
        message += ">";
        message += String(i) + "</option>";
    }
    message += "</select> %"
               "</td></tr>";
    // ------------------------------------------------------------------------
    message += "<tr><td>"
               "Color"
               "</td><td>"
               "<select name=\"co\">"
               "<option value=\"0\"";
    if (settings.mySettings.color == 0)
        message += " selected";
    message += ">"
               "White</option>"
               "<option value=\"1\"";
    if (settings.mySettings.color == 1)
        message += " selected";
    message += ">"
               "Red</option>"
               "<option value=\"2\"";
    if (settings.mySettings.color == 2)
        message += " selected";
    message += ">"
               "Red 75%</option>"
               "<option value=\"3\"";
    if (settings.mySettings.color == 3)
        message += " selected";
    message += ">"
               "Red 50%</option>"
               "<option value=\"4\"";
    if (settings.mySettings.color == 4)
        message += " selected";
    message += ">"
               "Orange</option>"
               "<option value=\"5\"";
    if (settings.mySettings.color == 5)
        message += " selected";
    message += ">"
               "Yellow</option>"
               "<option value=\"6\"";
    if (settings.mySettings.color == 6)
        message += " selected";
    message += ">"
               "Yellow 75%</option>"
               "<option value=\"7\"";
    if (settings.mySettings.color == 7)
        message += " selected";
    message += ">"
               "Yellow 50%</option>"
               "<option value=\"8\"";
    if (settings.mySettings.color == 8)
        message += " selected";
    message += ">"
               "Green-Yellow</option>"
               "<option value=\"9\"";
    if (settings.mySettings.color == 9)
        message += " selected";
    message += ">"
               "Green</option>"
               "<option value=\"10\"";
    if (settings.mySettings.color == 10)
        message += " selected";
    message += ">"
               "Green 75%</option>"
               "<option value=\"11\"";
    if (settings.mySettings.color == 11)
        message += " selected";
    message += ">"
               "Green 50%</option>"
               "<option value=\"12\"";
    if (settings.mySettings.color == 12)
        message += " selected";
    message += ">"
               "Mintgreen</option>"
               "<option value=\"13\"";
    if (settings.mySettings.color == 13)
        message += " selected";
    message += ">"
               "Cyan</option>"
               "<option value=\"14\"";
    if (settings.mySettings.color == 14)
        message += " selected";
    message += ">"
               "Cyan 75%</option>"
               "<option value=\"15\"";
    if (settings.mySettings.color == 15)
        message += " selected";
    message += ">"
               "Cyan 50%</option>"
               "<option value=\"16\"";
    if (settings.mySettings.color == 16)
        message += " selected";
    message += ">"
               "Light Blue</option>"
               "<option value=\"17\"";
    if (settings.mySettings.color == 17)
        message += " selected";
    message += ">"
               "Blue</option>"
               "<option value=\"18\"";
    if (settings.mySettings.color == 18)
        message += " selected";
    message += ">"
               "Blue 75%</option>"
               "<option value=\"19\"";
    if (settings.mySettings.color == 19)
        message += " selected";
    message += ">"
               "Blue 50%</option>"
               "<option value=\"20\"";
    if (settings.mySettings.color == 20)
        message += " selected";
    message += ">"
               "Violet</option>"
               "<option value=\"21\"";
    if (settings.mySettings.color == 21)
        message += " selected";
    message += ">"
               "Magenta</option>"
               "<option value=\"22\"";
    if (settings.mySettings.color == 22)
        message += " selected";
    message += ">"
               "Magenta 75%</option>"
               "<option value=\"23\"";
    if (settings.mySettings.color == 23)
        message += " selected";
    message += ">"
               "Magenta 50%</option>"
               "<option value=\"24\"";
    if (settings.mySettings.color == 24)
        message += " selected";
    message += ">"
               "Pink</option>"
               "</select>"
               "</td></tr>";
    // ------------------------------------------------------------------------
    message += "<tr><td>"
               "Colorchange"
               "</td><td>"
               "<input type=\"radio\" name=\"cc\" value=\"3\"";
    if (settings.mySettings.colorChange == 3)
        message += " checked";
    message += "> day "
               "<input type=\"radio\" name=\"cc\" value=\"2\"";
    if (settings.mySettings.colorChange == 2)
        message += " checked";
    message += "> hour "
               "<input type=\"radio\" name=\"cc\" value=\"1\"";
    if (settings.mySettings.colorChange == 1)
        message += " checked";
    message += "> five "
               "<input type=\"radio\" name=\"cc\" value=\"0\"";
    if (settings.mySettings.colorChange == 0)
        message += " checked";
    message += "> off"
               "</td></tr>";
    // ------------------------------------------------------------------------
#ifndef FRONTCOVER_BINARY
    message += "<tr><td>"
               "Transition"
               "</td><td>"
               "<input type=\"radio\" name=\"tr\" value=\"2\"";
    if (settings.mySettings.transition == 2)
        message += " checked";
    message += "> fade "
               "<input type=\"radio\" name=\"tr\" value=\"1\"";
    if (settings.mySettings.transition == 1)
        message += " checked";
    message += "> move "
               "<input type=\"radio\" name=\"tr\" value=\"0\"";
    if (settings.mySettings.transition == 0)
        message += " checked";
    message += "> none"
               "</td></tr>";
#endif
    // ------------------------------------------------------------------------
    message += "<tr><td>"
               "Timeout"
               "</td><td>"
               "<select name=\"to\">";
    for (int i = 0; i <= 60; i += 5)
    {
        message += "<option value=\"" + String(i) + "\"";
        if (i == settings.mySettings.timeout)
            message += " selected";
        message += ">";
        if (i < 10)
            message += "0";
        message += String(i) + "</option>";
    }
    message += "</select> sec."
               "</td></tr>";
    // ------------------------------------------------------------------------
    message += "<tr><td>"
               "Night off"
               "</td><td>"
               "<input type=\"time\" name=\"no\" value=\"";
    if (getHour(settings.mySettings.nightOffTime) < 10)
        message += "0";
    message += String(getHour(settings.mySettings.nightOffTime)) + ":";
    if (getMinute(settings.mySettings.nightOffTime) < 10)
        message += "0";
    message += String(getMinute(settings.mySettings.nightOffTime)) + "\">"
                                                                     " h"
                                                                     "</td></tr>";
    // ------------------------------------------------------------------------
    message += "<tr><td>"
               "Day on"
               "</td><td>"
               "<input type=\"time\" name=\"do\" value=\"";
    if (getHour(settings.mySettings.dayOnTime) < 10)
        message += "0";
    message += String(getHour(settings.mySettings.dayOnTime)) + ":";
    if (getMinute(settings.mySettings.dayOnTime) < 10)
        message += "0";
    message += String(getMinute(settings.mySettings.dayOnTime)) + "\">"
                                                                  " h"
                                                                  "</td></tr>";
    // ------------------------------------------------------------------------
    message += "<tr><td>"
               "Show \"It is\""
               "</td><td>"
               "<input type=\"radio\" name=\"ii\" value=\"1\"";
    if (settings.mySettings.itIs)
        message += " checked";
    message += "> " TXT_ON
               "<input type=\"radio\" name=\"ii\" value=\"0\"";
    if (!settings.mySettings.itIs)
        message += " checked";
    message += "> " TXT_OFF
               "</td></tr>";
    // ------------------------------------------------------------------------
    message += "<tr><td>"
               "Set date/time"
               "</td><td>"
               "<input type=\"datetime-local\" name=\"st\">"
               "</td></tr>";
    // ------------------------------------------------------------------------
    message += "</table>"
               "<br><button title=\"Save Settings.\"><i class=\"fa fa-check\"></i></button>"
               "</form></body></html>";
    webServer.send(200, "text/html", message);
}

